'''
爬虫第二课
在注释的过程中使用shift+3或者ctrl+?不过后者只能在pychame中使用
'''
#变量的定义
#在使用变量的情况下
#变量的格式:变量的名字=变量的值
weather='今天天气很好'
print(weather)
#应用场景   例如京东商城的商品图片
img='https://item.jd.com/100019538202.html'
print(img)
#变量是可变化的量可以随时修改
#程序用来处理数据,变量用来存储数据
'''
python中不同的数据类型
number(数字){
             int(有符号整型)
             long(长整型|也可以代表八进制和六进制)
             float(浮点型)与其余编程语言不同没有double
             complex(复数)
        }
bool(布尔类型){ true :代表真
                flase:代表假
                }
string(字符串):字符个数超过一个用单引号或者双引号引起
list(列表):将很多的数据放在一起进行描述
Tuple(元组):与列表类似用一个数据描述多个数据  字典在生成的过程中需要字符串,其中可以定义一个sting类型变量,之后通过字典名:变量名赋值'User-Agent': ua
Directionary(字典):通过某种手段来查询

set
'''
#这里的方法用来提供了变量的解释和声明貌似都是使用了单引号的方法传入所对应的相关值