#数据类型
'''
number {int float long complex}数字 整型 浮点型 长整型 复数 但是对于复数的使用较少
'''

'''
bool布尔
'''
'''
string字符串
'''
'''
list列表 使用方括号['周杰伦','科比']这里没有赋值的单独概念 通过一整个类似于数组的方式进行直接赋全值 如果是字符串就使用单引号
'''
'''
tuple元组  使用圆括号 其中的所有的数值不需要单引号
'''
'''
directionary字典 字典使用单引号对数据进行赋值
'''
#变量的基本使用
#number 数值
#int 
money=50000
#float
#例子
money1=1.3

#bool  布尔
#流程控制语句
#性别的变量
#性别在实际的开发中使用的单词是 sex,gender
sex =True
gender=False


#字符串 string
s='苍茫的天涯是我的爱'
s1="嘀嗒嘀嗒嘀"
#字符串在设计中使用单引号或者双引号
#嵌套单引号和双引号
s2="'嘿嘿嘿'"
s3='"啦啦啦"'
print(s2,s3)
#单引号不可嵌套单引号,双引号不可嵌套双引号
#引号之间的引用就近匹配原则
#s4=""dsdn""
#s5=''啥技术''